# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]                 输入640*640*3
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2       第0层，卷积（通道数64，卷积核尺寸6，步长2，padding2）后变为320*320*64
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                       #经过一次通道数512，卷积核1，步长1的卷积将20*20*1024特征层变为20*20*512
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],       #经过一次上采样获得40*40*512特征层
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4      与主干网络第6层也就是40*40*512的特征层拼接
   [-1, 3, C3, [512, False]],  # 13                   拼接后经过堆叠3次的c3结构，false表示该c3中的bottleneck结构不使用残差边

   [-1, 1, Conv, [256, 1, 1]],                       #经过一次通道数256，卷积核1，步长1的卷积将40*40*512特征层变为40*40*256
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],       #经过一次上采样获得80*80*256特征层
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3      与主干网络第4层的80*80*256的特征层拼接
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)      拼接后经过堆叠3次的c3结构，所得特征层连接检测头用于检测小尺寸目标

   [-1, 1, Conv, [256, 3, 2]],                       #经过一次通道数256，卷积核3，步长2的卷积将80*80*256特征层变为40*40*256
   [[-1, 14], 1, Concat, [1]],  # cat head P4         与网络第14层的40*40*256的特征层拼接
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)    拼接后经过堆叠3次的c3结构，通道数改为512，所得特征层连接检测头用于检测中尺寸目标

   [-1, 1, Conv, [512, 3, 2]],                       #经过一次通道数512，卷积核3，步长2的卷积将40*40*512特征层变为20*20*512
   [[-1, 10], 1, Concat, [1]],  # cat head P5         与网络第10层的20*20*512的特征层拼接
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)    拼接后经过堆叠3次的c3结构，通道数该为1024，所得特征层连接检测头用于检测大尺寸目标

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
