# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8 80*80
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32 20*20

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [64, 3, 2]],  # 1-P2/4
   [-1, 1, DSLK, [64,2,True,5]],
   [-1, 1, Conv, [128, 3, 2]],  # 3-P3/8
   [-1, 3, DSLK, [128,4,True,9,3]],
   [-1, 1, Conv, [256, 3, 2]],  # 5-P4/16
   [-1, 3, DSLK, [256,4,True,13,3]],
   [-1, 1, Conv, [512, 3, 2]],  # 7-P5/32
   [-1, 1, SPPF, [512, 5]],  # 9
   [-1, 1, DSLK, [512,4,False,27,5]],
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, DSLK, [128,4,False,3]],  # 13

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, DSLK, [128,4,False,3]],  # 17 (P3/8-small)

   [-1, 2, DSLKVit1, [128,80]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 1, DSLK, [128,4,False,3]],  # 20 (P4/16-medium)

   [-1, 2, DSLKVit2, [128,40]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 1, DSLK, [128,4,False,3]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
